// Baikov !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Baikov
// -----------------------------------------------------------------------
// Генератор задержки
   void my_delay(int delta){
     long start,end,ltime;
     int n;
   //char P_txt[255];
     start=time(&ltime);
     end  = start+delta;
     while (time(&ltime)<end){
       n=rand();
     };
   }//my_delay
// -----------------------------------------------------------------------
// Процедура перевода из десятичной в [град-мин-сек]
 void dec_gms(double ug,int *gi,int *mi,int *si){
    int zn,ugi;
    int dig,dim,dis;
    int uggi,ugmi,ugsi;
    zn   = ug/fabs(ug);
    ugi  = abs(ug*3600.0);
    uggi = ugi/3600;
    dig  = ugi-uggi*3600;
    ugmi = dig/60;
    dim  = dig-ugmi*60;
    ugsi = dim;
    *gi=uggi*zn;
    *mi=ugmi;
    *si=ugsi;
 // printf("===> ugi=%d; uggi=%d; dig=%d; ugmi=%d; dim=%d; ugsi=%d;\n",
 //              ugi,    uggi,    dig,    ugmi,    dim,    ugsi);
 // printf("     ug=%d град %d мин %d сек\n",uggi,ugmi,ugsi);
 };//dec_gms()
// -----------------------------------------------------------------------
double my_random1(double x0,double CKOx){
      double x,rnd;
      do {rnd=rand()*0.0001;} while(rnd>1);
      x = x0 + CKOx*(2*rnd-1);
      return x;
};//my_random1()



// Оценка точности наведения линии визирования ОЭС (ИП КПСТ)
void modlw(){
    // Переменные пересчета
       double ug=999.0;
       int ugi=999;
       int umi=999;
       int usi=999;
    // Обобщенный признак
       bool my_ERR=false;
    // Переменные выбора режима интерфейса (вывод данных на экран)
       int  nScr=-1;
       char sScr[256];
    // Переменные выбора режима фильтрации
       int  nReg=-1;
       char sReg[256];
    // Признак первого прохода
       bool prCP =false;
    // Переменная ввода
       char sss[256];
    // Коэффициенты пересчета
       double Pi,Pi2,gr,mr,sr;
       Pi =3.1415926;
       Pi2=2.0*Pi;
       gr =Pi/180.0;
       mr =gr/60.0;
       sr =mr/60.0;
    // Системные переменные
       int nTK_OES=1; // номер камеры
       int nST_OES=58;// номер ОЭС
    // Переменные задержки
       double tz2,tz5;
       tz2=2.0;
       tz5=5.0;
    // Переменные цикла
       int ii,iz,jz,kz,Nsum;
       int iA,iL,iR;
    // Переменные статистических оценок
       double MAT,DIS,CKO;
    // Переменные для ГСС
       double ddA,ddL,ddR;
       ddA=5.0;//[угл.град]
       ddL=5.0;//[угл.град]
       ddR=5.0;//[угл.град]
    // Номер цифровой камеры
       int NTK=1;
    // Количество вариантов пространственных точек по каждой оси
       int NizA=2;
       int NizL=2;
       int NizR=1;//всегда = 1
    // Количество измерений в каждой пространственной точке
       int Njz=2;
    // Переменные текущие
       double x,y;
         x=0;
         y=0;
       double Aiz,Liz,Riz; // ОПУ
       double Azt,Ht;      // ТСК
         Azt=0;
         Ht =0;
       double Azomr,Homr,EpsOMR;
         Azomr=0;
         Homr =0;
         EpsOMR=10.0*mr;// [угл.мин] - порог фильтрации ОМР-данных
    // Переменные рабочих интервалов
       double Amin,Lmin,Rmin;
         Amin=-15.0;
         Lmin=+30;
         Rmin=+90.0;// всегда = 90.0
       double Amax,Lmax,Rmax;
         Amax=+15.0;
         Lmax=+60.0;
         Rmax=+90.0;// всегда = 90.0
    // Вычисление шага
       double dA,dL,dR;
       if (NizA==1) dA=0;else dA=(Amax-Amin)/(NizA-1);
       if (NizL==1) dL=0;else dL=(Lmax-Lmin)/(NizL-1);
       if (NizR==1) dR=0;else dR=(Rmax-Rmin)/(NizR-1);
    // Массив опорных значение A0,L0,R0
       double mOPU[100][3];
    // Массив опорных значение AzT0,UgT0
       double mTCK[100][3];
    // Поиск max
       double Smin,Smax;
       Smin=+999.0;
       Smax=-1.0;
    // Массив ошибок (невязок)
       double mSigma[100][100];

    // Выбрать режим фильтрации входными данными
       printf("\n");
       printf(" ========================================================================\n");
       while (true){
          nScr=-1;
          printf(" Признак отображения текущей информации алгоритма на экран:\n");
          printf(" ------------------------------------------------\n");
          printf("  * 0 - только данные по блокам (логические узлы)\n");
          printf("  * 1 - с выводом промежуточных значений\n");
          printf(" ------------------------------------------------\n");
          printf("  ? ввод (мнемо режима => ");
          gets(sScr);
          sscanf(sScr,"%d",&nScr);
       // ====================================================================
       // Контроль формата ввода переменной "nReg"
          my_ERR=false;
          for (iz=0; iz<=1; iz++) if (nScr==iz){ my_ERR=true;break; };
          if (!my_ERR){
             printf(" Внимание! Ошибка ввода данных, недопустимый формат команды\n");
             continue;
          };//if
          break;
       };//while - Выбрать режим фильтрации входными данными
    // if ((sss[0]=='y')||(sss[0]=='Y')){
    // Открыть текстовый файл для записи
       FILE *f_Data;
       switch (nST_OES){
             case 57:
                 f_Data=fopen("tmpdan/modlw57.txt","w");
                 break;
             case 58:
                 f_Data=fopen("tmpdan/modlw58.txt","w");
                 break;
             case 59:
                 f_Data=fopen("tmpdan/modlw59.txt","w");
                 break;
             case 60:
                 f_Data=fopen("tmpdan/modlw60.txt","w");
                 break;
       };//switch

       printf(" ========================================================================\n");
       printf(" Внимание! Запущен модуль оценки точности наведения линии визирования ОЭС\n");
       printf("           -------------------------------------------------------\n");
       printf("           # Количество пространственных точек   = %d\n",NizA*NizL*NizR);
       printf("           # Количество измерений в каждой точке = %d\n",Njz);
       printf("           -------------------------------------------------------\n");
       printf(" ......... ждите, идет формирование опорных точек\n");
    // printf(" OK! ====> Выполнена задача формирование опорных точек\n");
    // Формирование опорных расчетных точек
       iz=0;
       for(iA=0; iA<NizA; iA++){
          Aiz=Amin+dA*iA;
          for(iL=0; iL<NizL; iL++){
             Liz=Lmin+dL*iL;
             for(iR=0; iR<NizR; iR++){
                Riz=Rmin+dR*iR;
                iz=iz+1;
                mOPU[iz-1][0]=Aiz;
                mOPU[iz-1][1]=Liz;
                mOPU[iz-1][2]=Riz;
             // Процедура пересчета направляющих косинусов ОПУ ОЭС в полярные координаты
                absmet(NTK,Aiz,Liz,Riz,0,0,&Azt,&Ht);
                mTCK[iz-1][0]=Azt;
                mTCK[iz-1][1]=Ht;
                if (nScr==1){
                   printf("           * iz=%2d; Aiz=%+07.2f; Liz=%+07.2f; Riz=%+07.2f; (iA=%d;iL=%d;iR=%d);\n",iz,Aiz,Liz,Riz,iA,iL,iR);
                   printf("                    Azt=%+07.2f; Ht= %+07.2f;\n",Azt/gr,Ht/gr);
                };//if
             };//iR
          };//iL
       };//iA
       Nsum=iz;
       printf(" OK! ====> Выполнена задача - сформировано [%d] опорных точек\n",Nsum);
       printf(" ========================================================================\n");
//     printf(" Далее нажмите <Enter> =>");
//     gets(sss);
//     exit(1);
       if (nScr==1){
          printf("\n");
          printf(" ========================================================================\n");
          printf(" Внимание! Запущен цикл формирования данных для расчета оценок точности\n");
          printf(" ========================================================================\n");
       }else{
          printf("\n");
          printf(" Ждите...\n");
       };//if
    // --------------------------------------------------------------------------
    // --------------------------------------------------------------------------
    // Цикл формирования данных для расчета оценок точности
       for(iz=0; iz<Nsum; iz++){
    // --------------------------------------------------------------------------
    // --------------------------------------------------------------------------
          if (nScr==1){
             printf("\n");
             printf(" Расчетная технологическая точка => %d\n",iz+1);
             printf(" -------------------------------------\n");
             printf(" EXE.....: Выполняется переброска ОПУ (режим КЭП - <по положению>)\n");
             printf(" POINT...: iz=%02d; Aiz===%+7.2f; Liz===%+7.2f; Riz===%+7.2f;\n",iz,mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
             printf(" INFO....: Ждите...\n");
          }else{
             printf(" ------------------------------------------------------------------------\n");
             printf(" Расчетная технологическая точка => %d\n",iz+1);
             printf(" ... POINT: Aiz=%+7.2f; Liz=%+7.2f; Riz=%+7.2f;\n",mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
          };//if
          perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
          RESCSN();
             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             printf(" ......... cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);
          my_delay(tz2);

          perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
          RESCSN();
             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             printf(" ......... cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);
          my_delay(tz2);

          perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
          RESCSN();
             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             printf(" ......... cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);

          if (nScr==1){
             printf(" OK! ====> Выполнена установка осей ОПУ\n");
             printf(" REAL....: iz=%02d; cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",iz,cd[0],cd[1],cd[2]);
             printf(" DELAY...: Далее технологическая задержка %3.1f [сек]\n",tz2);
             printf(" INFO....: Ждите...\n");
          };//if
          my_delay(tz2);
//        printf(" ========================================================================\n");
//        printf(" Далее нажмите <Enter> =>");
//        gets(sss);
          if (nScr==1){
             printf("\n");
             printf(" ========================================================================\n");
             printf(" Внимание! Запущен цикл формирования массива отсчетов в опорной точке\n");
             printf(" ========================================================================\n");
          };//if
       // --------------------------------------------------------------------------
//return;
       // --------------------------------------------------------------------------
       // Формирование массива отсчетов в опорной точке
          for(jz=0; jz<Njz; jz++){
       // --------------------------------------------------------------------------
       // --------------------------------------------------------------------------
             if (nScr==1){
                printf("\n");
                printf(" Технологический отсчет => %d.%d\n",iz+1,jz+1);
                printf(" -------------------------------------\n");
                printf(" EXE.....: Выполняется отклонение оси ЛВ ОПУ (режим КЭП - <по положению>)\n");
             }else{
                printf("     N=%d.%d; \n",iz+1,jz+1);
             };//if
             Aiz=my_random1(mOPU[iz][0],ddA)/cos(mOPU[iz][1]*gr);
             Liz=my_random1(mOPU[iz][1],ddL);
             Riz=my_random1(mOPU[iz][2],ddR);
             if (nScr==1){
                printf(" ГСС.....: iz=%02d; jz=%02d; Aiz===%+7.2f; Liz===%+7.2f; Riz===%+7.2f;\n",iz,jz,Aiz,Liz,Riz);
                printf(" INFO....: Ждите...\n");
             };//if
             perebroscsn(Aiz,Liz,Riz);
             RESCSN();
             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             printf(" ......... cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);
             my_delay(tz2);


             perebroscsn(Aiz,Liz,Riz);
             RESCSN();
             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             printf(" ......... cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);
             my_delay(tz2);

             perebroscsn(Aiz,Liz,Riz);
             RESCSN();

             if (nScr==1){
                printf(" OK! ====> Выполнено отклонение оси ЛВ ОПУ (режим КЭП - <по положению>)\n");
                printf(" REAL....: iz=%02d; jz=%02d; cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",iz,jz,cd[0],cd[1],cd[2]);
                printf(" DELAY...: Далее технологическая задержка %3.1f [сек]\n",tz2);
                printf(" INFO....: Ждите...\n");
             };//if
             my_delay(tz2);
//           printf(" Далее нажмите <Enter> =>");
//           gets(sss);
//            exit(1);
             if (nScr==1){
                printf(" ========================================================================\n");
                printf(" EXE.....: Выполняется установка оси ЛВ ОПУ (режим КЭП - <по положению>)\n");
                printf(" POINT...: iz=%02d; jz=%02d; Aiz===%+7.2f; Liz===%+7.2f; Riz===%+7.2f;\n",iz,jz,mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
                printf("           Ждите...\n");
             };//if
             perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
             RESCSN();
             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             my_delay(tz2);

             perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
             RESCSN();
             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             my_delay(tz2);


             printf(" ......... Выполняется процедура позиционирования оси ОПУ\n");
             perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
             RESCSN();

             if (nScr==1){
                printf(" OK! ====> Выполнена установка оси ЛВ ОПУ\n");
                printf(" REAL....: iz=%02d; jz=%02d; cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",iz,jz,cd[0],cd[1],cd[2]);
                printf(" DELAY...: Далее технологическая задержка %3.1f [сек]\n",tz2);
                printf(" INFO....: Ждите...\n");
             };//if
             my_delay(tz2);

//           printf("\n*************************************************************************\n");
          // Процедура пересчета направляющих косинусов ОПУ ОЭС в полярные координаты
             absmet(NTK,cd[0],cd[1],cd[2],0,0,&Azt,&Ht);
//           if (!PUSKCHV(acd[i],lcd[i],rcd[i])) break;
             if (!IZMERAPOI(RABTK)) {
                if (nScr==1){
                   printf(" Внимание! Отсутствуют измерения от АПОИ (ОМР данные)\n");
                }else{
                   printf(" Внимание! Отсутствуют измерения от АПОИ (ОМР данные)\n");
                };
                continue;
             };//if
             for(ii=1;ii<=MAXTK;ii++) if (RABTK[ii]) { MetodOMR(ii); };//printOMR(ii); };
             OMRDATA &o=omrdata[NTK];
             x=0; y=0;
             korrxyOMR(NTK,&x,&y);
             absmet(NTK,o.A,o.L,o.R,x,y,&Azomr,&Homr);

//!!!
//if (iz==1) Azomr=567.0;
//if (iz==3) Homr =222.0;

             if ((fabs(Azt-Azomr)>EpsOMR)||(fabs(Ht-Homr)>EpsOMR)){
                if (nScr==1){
                   printf(" Внимание! Аномальные измерения от АПОИ (ОМР данные)\n");
                }else{
                   printf(" Внимание! Аномальные измерения от АПОИ (ОМР данные)\n");
                };//if
                   printf("           Текущий замер игнорируется...\n");
                mSigma[iz][jz] = 999.0;
             }else{
                mSigma[iz][jz] = acos( sin(Homr)*sin(Ht) + cos(Homr)*cos(Ht)*cos(Azomr-Azt) );
             };//if
//           printf("*************************************************************************\n");
             if (nScr==1){
                printf(" OK! ====> Выполнен расчет текущего отклонения ЛВ ОПУ (данные ОМР)\n");
                printf(" REAL....: iz=%02d; jz=%02d; Azt===%+12.6f; Ht===%+12.6f; \n",iz,jz,Azt/gr,Ht/gr);
                printf(" OMR.....: iz=%02d; jz=%02d; Azomr=%+12.6f; Homr=%+12.6f; \n",iz,jz,Azomr/gr,Homr/gr);
                printf(" ------------------------------------------------------------------------\n");
                printf(" REZULT..: mSigma=%f [угл.мин]; \n",mSigma[iz][jz]/mr);
                printf(" ========================================================================\n");
             }else{
                printf("     mSigma=%f [угл.мин]; \n",mSigma[iz][jz]/mr);
//              printf(" ------------------------------------------------------------------------\n");
             };//if
          // Формирование записи текстового файла - текущее отклонение
          // ------------------------------------------------
             fprintf(f_Data,"%d",iz);
             fprintf(f_Data,"%c",' ');
          // ------------------------------------------------
             fprintf(f_Data,"%d",jz);
             fprintf(f_Data,"%c",' ');
          // ------------------------------------------------
             fprintf(f_Data,"%12.8f",mSigma[iz][jz]/mr);
             fprintf(f_Data,"%c",'\n');
          // ------------------------------------------------
//           printf(" Далее нажмите <Enter> =>");
//           gets(sss);
//           printf(" ========================================================================\n");

          };//jz - Формирование массива отсчетов в опорной точке
       };//iz - Цикл формирования данных для расчета оценок точности

       if (nScr==0) printf(" ------------------------------------------------------------------------\n");

    // Цикл формирования оценок выборочного среднего значения дуги рассогласования
       Smin=+999.0;
       Smax=-1.0;
       MAT=0; // выборочное среднее
       DIS=0; // выборочное среднеее квадратичной формы
       kz=0;
       for(iz=0; iz<Nsum; iz++){
          for(jz=0; jz<Njz; jz++){
             if (!(mSigma[iz][jz]==999.0)){
                kz=kz+1;
                MAT=MAT+mSigma[iz][jz];
                DIS=DIS+mSigma[iz][jz]*mSigma[iz][jz];
                if (Smin>mSigma[iz][jz]) Smin=mSigma[iz][jz];
                if (Smax<mSigma[iz][jz]) Smax=mSigma[iz][jz];
             };//if
          };//jz
       };//iz
    // printf("         # Nsum =%d;\n",kz);
    // Выборочное среднее
       MAT=MAT/kz;
       DIS=sqrt(DIS/(kz-1));
    // Цикл формирования оценок выборочного среднего  дуги рассогласования
       CKO=0;
       kz=0;
       for(iz=0; iz<Nsum; iz++){
          for(jz=0; jz<Njz; jz++){
             if (!(mSigma[iz][jz]==999.0)){
                kz=kz+1;
                CKO=CKO+(MAT-mSigma[iz][jz])*(MAT-mSigma[iz][jz]);
             };//if
          };//jz
       };//iz
    // printf("         # Nsum =%d;\n",kz);
    // Выборочная дисперсия
       if (kz==1) {CKO=-0.0;} else {CKO=sqrt(CKO/(kz-1));};
       printf("\n");
       printf(" ========================================================================\n");
       printf(" Внимание! Сформированы оценки точности наведения линии визирования ОПУ\n");
       printf("         # Nsum =%d;\n",kz);
       printf("         # MAT  =%+8.4f [угл.мин]; DIS =%+8.4f [угл.мин]; CKO =%+8.4f [угл.мин];\n",MAT/mr,DIS/mr, CKO/mr);
       printf("         # Smin =%+8.4f [угл.мин]; Smax=%+8.4f [угл.мин];\n",Smin/mr,Smax/mr);
       printf(" ========================================================================\n");
       printf("\n");
       printf(" ========================================================================\n");
    // printf(" Запись (перезапись) в файл БД: <y,Y>-да; <Enter>-нет;\n");
    // printf(" =>");
    // gets(sss);
    // printf(" ========================================================================\n");
    // Запись данных в файл БД
    // if ((sss[0]=='y')||(sss[0]=='Y')){
       // FILE *f_Data;
       // f_Data=fopen("tmpdan/modlw60.txt","w");
       // -------------------------------------
//        fprintf(f_Data,"%d",kz);
//        fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",MAT/mr);
          fprintf(f_Data,"%c",' ');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",DIS/mr);
          fprintf(f_Data,"%c",' ');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",CKO/mr);
          fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",Smin/mr);
          fprintf(f_Data,"%c",' ');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",Smax/mr);
          fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fprintf(f_Data,"%d",kz);
          fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fclose(f_Data);
          switch (nST_OES){
             case 57:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw57.txt>\n");
                 break;
             case 58:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw58.txt>\n");
                 break;
             case 59:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw59.txt>\n");
                 break;
             case 60:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw60.txt>\n");
                 break;
          };//switch
    //    printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw60.txt>\n");
    // }else{
       // printf(" Внимание! Запись данных в файл БД не выполнялась\n");
    // };//if
       printf(" ========================================================================\n");

};// modlw() - Оценка точности наведения линии визирования ОЭС (ИП КПСТ)




// -----------------------------------------------------------------------
// Оценка точности наведения линии визирования ОЭС (ИП КПСТ)
/*
void modlw(){
    // Переменные пересчета
       double ug=999.0;
       int ugi=999;
       int umi=999;
       int usi=999;
    // Обобщенный признак
       bool my_ERR=false;
    // Переменные выбора режима интерфейса (вывод данных на экран)
       int  nScr=-1;
       char sScr[256];
    // Переменные выбора режима фильтрации
       int  nReg=-1;
       char sReg[256];
    // Признак первого прохода
       bool prCP =false;
    // Переменная ввода
       char sss[256];
    // Коэффициенты пересчета
       double Pi,Pi2,gr,mr,sr;
       Pi =3.1415926;
       Pi2=2.0*Pi;
       gr =Pi/180.0;
       mr =gr/60.0;
       sr =mr/60.0;
    // Системные переменные
       int nTK_OES=1; // номер камеры
       int nST_OES=591;// номер ОЭС
    // Параметры контура позиционирования
       int jp;
       int Njp=
       1;
    // Переменные задержки
       double tz05,tz1,tz2,tz3,tz5;
       tz05= 0.5;
       tz1 = 1.0;
       tz2 = 2.0;
       tz3 = 3.0;
       tz5 = 5.0;
    // Переменные цикла
       int ii,iz,jz,kz,Nsum;
       int iA,iL,iR;
    // Переменные статистических оценок
       double MAT,DIS,CKO;
    // Переменные для ГСС
       double ddA,ddL,ddR;
       ddA=5.0;//[угл.град]
       ddL=5.0;//[угл.град]
       ddR=5.0;//[угл.град]
    // Номер цифровой камеры
       int NTK=1;
    // Количество вариантов пространственных точек по каждой оси
       int NizA=2;
       int NizL=2;
       int NizR=1;//всегда = 1
    // Количество измерений в каждой пространственной точке
       int Njz=3;
    // Переменные текущие
       double x,y;
         x=0;
         y=0;
       double Aiz,Liz,Riz; // ОПУ
       double Azt,Ht;      // ТСК
         Azt=0;
         Ht =0;
       double Azomr,Homr,EpsOMR;
         Azomr=0;
         Homr =0;
         EpsOMR=10.0*mr;// [угл.мин] - порог фильтрации ОМР-данных
    // Переменные рабочих интервалов
       double Amin,Lmin,Rmin;
         Amin=-15.0;
         Lmin=+30;
         Rmin=+90.0;// всегда = 90.0
       double Amax,Lmax,Rmax;
         Amax=+15.0;
         Lmax=+60.0;
         Rmax=+90.0;// всегда = 90.0
    // Вычисление шага
       double dA,dL,dR;
       if (NizA==1) dA=0;else dA=(Amax-Amin)/(NizA-1);
       if (NizL==1) dL=0;else dL=(Lmax-Lmin)/(NizL-1);
       if (NizR==1) dR=0;else dR=(Rmax-Rmin)/(NizR-1);
    // Массив опорных значение A0,L0,R0
       double mOPU[100][3];
    // Массив опорных значение AzT0,UgT0
       double mTCK[100][3];
    // Поиск max
       double Smin,Smax;
       Smin=+999.0;
       Smax=-1.0;
    // Массив ошибок (невязок)
       double mSigma[100][100];

    // Выбрать режим фильтрации входными данными
       printf("\n");
       printf(" ========================================================================\n");
       while (true){
          nScr=-1;
          printf(" Признак отображения текущей информации алгоритма на экран:\n");
          printf(" ------------------------------------------------\n");
          printf("  * 0 - только данные по блокам (логические узлы)\n");
          printf("  * 1 - с выводом промежуточных значений\n");
          printf(" ------------------------------------------------\n");
          printf("  ? ввод (мнемо режима => ");
          gets(sScr);
          sscanf(sScr,"%d",&nScr);
       // ====================================================================
       // Контроль формата ввода переменной "nReg"
          my_ERR=false;
          for (iz=0; iz<=1; iz++) if (nScr==iz){ my_ERR=true;break; };
          if (!my_ERR){
             printf(" Внимание! Ошибка ввода данных, недопустимый формат команды\n");
             continue;
          };//if
          break;
       };//while - Выбрать режим фильтрации входными данными
    // if ((sss[0]=='y')||(sss[0]=='Y')){
    // Открыть текстовый файл для записи
       FILE *f_Data;
       switch (nST_OES){
             case 561:
                 f_Data=fopen("tmpdan/modlw561.txt","w");
                 break;
             case 562:
                 f_Data=fopen("tmpdan/modlw562.txt","w");
                 break;
              // --------------------------------
             case 571:
                 f_Data=fopen("tmpdan/modlw571.txt","w");
                 break;
             case 572:
                 f_Data=fopen("tmpdan/modlw572.txt","w");
                 break;
              // --------------------------------
             case 581:
                 f_Data=fopen("tmpdan/modlw581.txt","w");
                 break;
             case 582:
                 f_Data=fopen("tmpdan/modlw582.txt","w");
                 break;
              // --------------------------------
             case 591:
                 f_Data=fopen("tmpdan/modlw591.txt","w");
                 break;
             case 592:
                 f_Data=fopen("tmpdan/modlw592.txt","w");
                 break;
              // --------------------------------
             case 601:
                 f_Data=fopen("tmpdan/modlw601.txt","w");
                 break;
             case 602:
                 f_Data=fopen("tmpdan/modlw602.txt","w");
                 break;
              // --------------------------------
       };//switch
       //printf(" ========================================================================\n");
       printf("\n");

       printf(" Внимание! Запущен модуль оценки точности наведения линии визирования ОЭС\n");
       printf("           -------------------------------------------------------\n");
       printf("           # Количество пространственных точек   = %d\n",NizA*NizL*NizR);
       printf("           # Количество измерений в каждой точке = %d\n",Njz);
       printf("           -------------------------------------------------------\n");
       printf(" ......... ждите, идет формирование опорных точек\n");
    // printf(" OK! ====> Выполнена задача формирование опорных точек\n");
    // Формирование опорных расчетных точек
       iz=0;
       for(iA=0; iA<NizA; iA++){
          Aiz=Amin+dA*iA;
          for(iL=0; iL<NizL; iL++){
             Liz=Lmin+dL*iL;
             for(iR=0; iR<NizR; iR++){
                Riz=Rmin+dR*iR;
                iz=iz+1;
                mOPU[iz-1][0]=Aiz;
                mOPU[iz-1][1]=Liz;
                mOPU[iz-1][2]=Riz;
             // Процедура пересчета направляющих косинусов ОПУ ОЭС в полярные координаты
                absmet(NTK,Aiz,Liz,Riz,0,0,&Azt,&Ht);
                mTCK[iz-1][0]=Azt;
                mTCK[iz-1][1]=Ht;
                if (nScr==1){
                   printf("           * iz=%2d; Aiz=%+07.2f; Liz=%+07.2f; Riz=%+07.2f; (iA=%d;iL=%d;iR=%d);\n",iz,Aiz,Liz,Riz,iA,iL,iR);
                   printf("                    Azt=%+07.2f; Ht= %+07.2f;\n",Azt/gr,Ht/gr);
                };//if
             };//iR
          };//iL
       };//iA
       Nsum=iz;
       printf(" OK! ====> Выполнена задача - сформировано [%d] опорных точек\n",Nsum);
       printf(" ========================================================================\n");

//       printf(" Далее нажмите <Enter> =>");
//       gets(sss);

       printf("\n");
    // Цикл формирования данных для расчета оценок точности
       for(iz=0; iz<Nsum; iz++){
          printf("\n");
          printf(" Расчетная технологическая точка => %d\n",iz+1);
          printf(" ========================================================================\n");

       // Контур позиционирования ("псевдокоррекция") при переброске ЛВ в точку
       // -----------------------------------------------------------------------------------------
          if (nScr==1){
             printf(" Операция: Выполняется переброска ОПУ (режим КЭП - <по положению>)\n");
             printf(" Из точки: cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);

             printf(" В  точку: Aiz===%+7.2f; Liz===%+7.2f; Riz===%+7.2f;\n",mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
             printf(" ........: Ждите...\n");
          };//if

          for(jp=1; jp<=Njp; jp++){
             perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
             RESCSN();
             if (nScr==1){
                printf(" Шаг_%d...: cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",jp,cd[0],cd[1],cd[2]);
             };//if
             my_delay(tz2);
          };//jp

       // Формирование массива отсчетов в опорной точке
          for(jz=0; jz<Njz; jz++){
       // --------------------------------------------------------------------------
             if (nScr==1){
                printf("\n");
                printf(" Отсчет => %d.%d\n",iz+1,jz+1);
                printf(" ------------------------------------------------------------------------\n");
                printf(" Операция: Выполняется отклонение оси ЛВ ОПУ (режим КЭП - <по положению>)\n");
             }else{
                printf("     N=%d.%d; \n",iz+1,jz+1);
             };//if
             Aiz=my_random1(mOPU[iz][0],ddA)/cos(mOPU[iz][1]*gr);
             Liz=my_random1(mOPU[iz][1],ddL);
             Riz=my_random1(mOPU[iz][2],ddR);
             if (nScr==1){
                printf(" От точки: cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);

                printf(" ГСС.....: iz=%02d; jz=%02d; Aiz===%+7.2f; Liz===%+7.2f; Riz===%+7.2f;\n",iz,jz,Aiz,Liz,Riz);
                printf(" ........: Ждите...\n");
             };//if
          // -----------------------------------------------------------------------------------------

             perebroscsn(Aiz,Liz,Riz);
             RESCSN();
             if (nScr==1){
                printf(" Встала..: cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",cd[0],cd[1],cd[2]);
                printf(" ........: Ждите...\n");
             };//if
             my_delay(tz2);
          // -----------------------------------------------------------------------------------------
             if (nScr==1){
                printf(" OK! ====> Выполнено отклонение оси ЛВ ОПУ (режим КЭП - <по положению>)\n");
             };//if

//             printf(" Далее нажмите <Enter> =>");
//             gets(sss);

             if (nScr==1){
                printf("\n");
                printf(" Операция: Выполняется возврат оси ЛВ ОПУ (режим КЭП - <по положению>)\n");
                printf(" В точку.: iz=%02d; jz=%02d;  Aiz===%+7.2f; Liz===%+7.2f; Riz===%+7.2f;\n",iz,jz,mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
                printf(" ........: Ждите...\n");
             };//if
          // Контур позиционирования ("псевдокоррекция") при переброске ЛВ в точку
          // -----------------------------------------------------------------------------------------
             for(jp=1; jp<=Njp; jp++){
                perebroscsn(mOPU[iz][0],mOPU[iz][1],mOPU[iz][2]);
                RESCSN();
                if (nScr==1){
                   printf(" Шаг_%d...: cd[0]=%+7.2f; cd[1]=%+7.2f; cd[2]=%+7.2f;\n",jp,cd[0],cd[1],cd[2]);
                   printf(" ........: Ждите...\n");
                };//if
                my_delay(tz2);
             };//jp
          // -----------------------------------------------------------------------------------------

             if (nScr==1){
                printf(" OK! ====> Выполнена установка оси ЛВ ОПУ                 !!!!!!!!\n");
             };//if

          // Процедура пересчета направляющих косинусов ОПУ ОЭС в полярные координаты
             absmet(NTK,cd[0],cd[1],cd[2],0,0,&Azt,&Ht);
//           if (!PUSKCHV(acd[i],lcd[i],rcd[i])) break;
             if (!IZMERAPOI(RABTK)) {
                if (nScr==1){
                   printf(" Внимание! Отсутствуют измерения от АПОИ (ОМР данные)\n");
                }else{
                   printf(" Внимание! Отсутствуют измерения от АПОИ (ОМР данные)\n");
                };
                continue;
             };//if
             for(ii=1;ii<=MAXTK;ii++) if (RABTK[ii]) { MetodOMR(ii); };//printOMR(ii); };
             OMRDATA &o=omrdata[NTK];
             x=0; y=0;
             korrxyOMR(NTK,&x,&y);
             absmet(NTK,o.A,o.L,o.R,x,y,&Azomr,&Homr);

             if ((fabs(Azt-Azomr)>EpsOMR)||(fabs(Ht-Homr)>EpsOMR)){
                if (nScr==1){
                   printf(" Внимание! Аномальные измерения от АПОИ (ОМР данные)\n");
                }else{
                   printf(" Внимание! Аномальные измерения от АПОИ (ОМР данные)\n");
                };//if
                   printf("           Текущий замер игнорируется...\n");
                mSigma[iz][jz] = 999.0;
             }else{
                mSigma[iz][jz] = acos( sin(Homr)*sin(Ht) + cos(Homr)*cos(Ht)*cos(Azomr-Azt) );
             };//if
//           printf("*************************************************************************\n");
             if (nScr==1){
                printf(" OK! ====> Выполнен расчет текущего отклонения ЛВ ОПУ (данные ОМР)\n");
                printf(" REAL....: iz=%02d; jz=%02d; Azt===%+12.6f; Ht===%+12.6f; \n",iz,jz,Azt/gr,Ht/gr);
                printf(" OMR.....: iz=%02d; jz=%02d; Azomr=%+12.6f; Homr=%+12.6f; \n",iz,jz,Azomr/gr,Homr/gr);
                printf(" ------------------------------------------------------------------------\n");
                printf(" REZULT..: mSigma=%f [угл.мин]; \n",mSigma[iz][jz]/mr);
                printf(" ========================================================================\n");
             }else{
                printf("     mSigma=%f [угл.мин]; \n",mSigma[iz][jz]/mr);
//              printf(" ------------------------------------------------------------------------\n");
             };//if
          // Формирование записи текстового файла - текущее отклонение
          // ------------------------------------------------
             fprintf(f_Data,"%d",iz);
             fprintf(f_Data,"%c",' ');
          // ------------------------------------------------
             fprintf(f_Data,"%d",jz);
             fprintf(f_Data,"%c",' ');
          // ------------------------------------------------
             fprintf(f_Data,"%12.8f",mSigma[iz][jz]/mr);
             fprintf(f_Data,"%c",'\n');
          // ------------------------------------------------
//           printf(" Далее нажмите <Enter> =>");
//           gets(sss);
           printf(" ========================================================================\n");

          };//jz - Формирование массива отсчетов в опорной точке
       };//iz - Цикл формирования данных для расчета оценок точности

       if (nScr==0) printf(" ------------------------------------------------------------------------\n");

    // Цикл формирования оценок выборочного среднего значения дуги рассогласования
       Smin=+999.0;
       Smax=-1.0;
       MAT=0; // выборочное среднее
       DIS=0; // выборочное среднеее квадратичной формы
       kz=0;
       for(iz=0; iz<Nsum; iz++){
          for(jz=0; jz<Njz; jz++){
             if (!(mSigma[iz][jz]==999.0)){
                kz=kz+1;
                MAT=MAT+mSigma[iz][jz];
                DIS=DIS+mSigma[iz][jz]*mSigma[iz][jz];
                if (Smin>mSigma[iz][jz]) Smin=mSigma[iz][jz];
                if (Smax<mSigma[iz][jz]) Smax=mSigma[iz][jz];
             };//if
          };//jz
       };//iz
    // printf("         # Nsum =%d;\n",kz);
    // Выборочное среднее
       MAT=MAT/kz;
       DIS=sqrt(DIS/(kz-1));
    // Цикл формирования оценок выборочного среднего  дуги рассогласования
       CKO=0;
       kz=0;
       for(iz=0; iz<Nsum; iz++){
          for(jz=0; jz<Njz; jz++){
             if (!(mSigma[iz][jz]==999.0)){
                kz=kz+1;
                CKO=CKO+(MAT-mSigma[iz][jz])*(MAT-mSigma[iz][jz]);
             };//if
          };//jz
       };//iz
    // printf("         # Nsum =%d;\n",kz);
    // Выборочная дисперсия
       if (kz==1) {CKO=-0.0;} else {CKO=sqrt(CKO/(kz-1));};
       printf("\n");
       printf(" ========================================================================\n");
       printf(" Внимание! Сформированы оценки точности наведения линии визирования ОПУ\n");
       printf("         # Nsum =%d;\n",kz);
       printf("         # MAT  =%+8.4f [угл.мин]; DIS =%+8.4f [угл.мин]; CKO =%+8.4f [угл.мин];\n",MAT/mr,DIS/mr, CKO/mr);
       printf("         # Smin =%+8.4f [угл.мин]; Smax=%+8.4f [угл.мин];\n",Smin/mr,Smax/mr);
       printf(" ========================================================================\n");
       printf("\n");
       printf(" ========================================================================\n");
    // printf(" Запись (перезапись) в файл БД: <y,Y>-да; <Enter>-нет;\n");
    // printf(" =>");
    // gets(sss);
    // printf(" ========================================================================\n");
    // Запись данных в файл БД
    // if ((sss[0]=='y')||(sss[0]=='Y')){
       // FILE *f_Data;
       // f_Data=fopen("tmpdan/modlw60.txt","w");
       // -------------------------------------
//        fprintf(f_Data,"%d",kz);
//        fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",MAT/mr);
          fprintf(f_Data,"%c",' ');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",DIS/mr);
          fprintf(f_Data,"%c",' ');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",CKO/mr);
          fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",Smin/mr);
          fprintf(f_Data,"%c",' ');
       // -------------------------------------
          fprintf(f_Data,"%+012.6f",Smax/mr);
          fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fprintf(f_Data,"%d",kz);
          fprintf(f_Data,"%c",'\n');
       // -------------------------------------
          fclose(f_Data);
          switch (nST_OES){
             case 561:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw561.txt>\n");
                 break;
             case 562:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw562.txt>\n");
                 break;
                  // ---------------------------------------------------------------------------------
             case 571:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw571.txt>\n");
                 break;
             case 572:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw572.txt>\n");
                 break;
                  // ---------------------------------------------------------------------------------
             case 581:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw581.txt>\n");
                 break;
             case 582:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw582.txt>\n");
                 break;
                  // ---------------------------------------------------------------------------------
             case 591:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw591.txt>\n");
                 break;
             case 592:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw592.txt>\n");
                 break;
                  // ---------------------------------------------------------------------------------
             case 601:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw601.txt>\n");
                 break;
             case 602:
                 printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw602.txt>\n");
                 break;
                  // ---------------------------------------------------------------------------------
          };//switch
    //    printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modlw60.txt>\n");
    // }else{
       // printf(" Внимание! Запись данных в файл БД не выполнялась\n");
    // };//if
       printf(" ========================================================================\n");

};// modlw() - Оценка точности наведения линии визирования ОЭС (ИП КПСТ)
*/

// Исследование характеристик ВО
void modkw(){
    // Переменные пересчета
       double ug=999.0;
       int ugi=999;
       int umi=999;
       int usi=999;
    // Переменная ввода
       char sss[256];
    // Коэффициенты пересчета
       double Pi,Pi2,gr,mr,sr;
       Pi =3.1415926;
       Pi2=2.0*Pi;
       gr =Pi/180.0;
       mr =gr/60.0;
       sr =mr/60.0;
    // Системные переменные
       int nTK_OES=1; // номер камеры
       int nST_OES=591;// номер ОЭС
    // Переменные выбора режима интерфейса (вывод данных на экран)
       int  nScr=-1;
       char sScr[256];
    // Переменные выбора режима фильтрации
       int  nReg=-1;
       char sReg[256];
    // Признак первого прохода
       bool prCP =false;
    // Переменные цикла
       int iz,jz,kz,Nz,js;
       int jos,jkw;
    // Скорость
       double Vtek= 20.0*mr/gr;
    // Массив отсечек ВО
       double mDelta[3][2];
       for(iz=0; iz<3; iz++)
       for(jz=0; jz<2; jz++) mDelta[iz][jz]=999.0;

    // Переменные
       double s1,ds,EpsUg,Dt;
       EpsUg=0.015;
       Dt   =2.000;
    // Переменные задержки
       double tz2,tz5;
       tz2=2.0;
       tz5=5.0;
    // Начальная установка осей
       double Amin0,Amax0;
              Amin0=-200.0;
              Amax0=+200.0;
       double Lmin0,Lmax0;
              Lmin0=+030.0;
              Lmax0=+150.0;
       double Rmin0,Rmax0;
              Rmin0=+025.0;
              Rmax0=+150.0;

       printf(" ========================================================================\n");
       printf(" Внимание! Запущен модуль формирования характеристик ВО ОПУ\n");
       printf("           -------------------------------------------------------\n");
       printf("           # режим - <полуавтомат по скорости>\n",Vtek);
       printf("           # Vtek=%+08.4f [угл.мин/сек]\n",Vtek*gr/mr);
       printf("           -------------------------------------------------------\n");
    // Цикл по осям ОПУ
       for(jos=0; jos<3; jos++){

       // Цикл по ВО 2-го уровня
          for(jkw=0; jkw<2; jkw++){

             switch(jos){
// case
                 case 0:
                     printf(" Внимание! Выбрана азимутальная ось (ось A)\n");
                     if (jkw==0) printf("           Выбран  левый (-) ВО 2-го уровня\n");
                     else        printf("           Выбран правый (+) ВО 2-го уровня\n");
                     printf("           ... ждите\n");
                     printf("           ... идет переброска в режиме <полуавтомат по положению>\n");
                     if (jkw==0){printf("       ==> (-)\n");perebroscsn(Amin0,999.0,999.0);}
                     else{       printf("       ==> (+)\n");perebroscsn(Amax0,999.0,999.0);};
                     RESCSN();
                     printf(" OK! ====> Выполнена установка осей в начальное положение\n");
                     printf("           # Amin0=%+08.4f [угл.град]\n",cd[0]);
                     printf(" ========================================================================\n");
                     printf(" Внимание! Далее технологическая задержка %3.1f [сек]\n",tz5);
                     printf("           Ждите...\n");
                     my_delay(tz5);
                  // printf("Далее нажмите <Enter> =>");
                  // gets(sss);
                     printf(" ========================================================================\n");
                     printf(" Внимание! Переход к управлению в режиме <полуавтомат по скорости>\n");
                     if (jkw==0){printf("       ==> (-V)\n");skorcsn(-Vtek,999.0,999.0);}
                     else{       printf("       ==> (+V)\n");skorcsn( Vtek,999.0,999.0);};
                     printf("           Ждите...\n");
                     jz=0; s1=cd[0]; ds=999.0;
                     while(ds>EpsUg){
                     // printf("           # jz=%d; Az=%+08.4f [угл.град]\n",jz,cd[0]);
                     // Генератор задержки
                        my_delay(Dt);
                        ds=fabs(s1-cd[0]);
                        s1=cd[0];
                        jz=jz+1;
                     };//while
                     skorcsn(0.0, 0.0, 0.0);
                  // Остановка оси ОПУ
                     printf(" Внимание! КЭП(A)=<Stop>\n");
                     printf("           Далее технологическая задержка %3.1f [сек]\n",tz2);
                     printf("           Ждите...\n");
                     my_delay(tz2);
                     printf(" OK! ====> КЭП(A)=<Stop>\n");
                     if (jkw==0){printf(" OK! ====> Выполнен захват ВО оси A (-) 2-го уровня\n");
                                 mDelta[0][0]=cd[0];}
                     else       {printf(" OK! ====> Выполнен захват ВО оси A (+) 2-го уровня\n");
                                 mDelta[0][1]=cd[0];};
                                 printf("           # Aout=%+08.4f [угл.град]\n",cd[0]);
                     printf(" ========================================================================\n");
                     if (jkw==1){
                        printf(" Внимание! Установка оси A в положение технологического <0>\n");
                        printf("           ... ждите\n");
                        printf("           ... идет переброска в режиме <полуавтомат по положению>\n");
                        perebroscsn(0.0,999.0,999.0);
                        RESCSN();
                        printf(" OK! ====> Выполнена установка оси A в положение 0.0 [угл.град]\n");
                        printf(" Внимание! Далее технологическая задержка %3.1f [сек]\n",tz5);
                        printf("           Ждите...\n");
                        my_delay(tz5);
                        printf(" ========================================================================\n");
                     };//jkw==1
                     break;
// case
                 case 1:
                     printf(" Внимание! Выбрана полярная ось (ось L)\n");
                     if (jkw==0) printf("           Выбран  левый (-) ВО 2-го уровня\n");
                     else        printf("           Выбран правый (+) ВО 2-го уровня\n");
                     printf("           ... ждите\n");
                     printf("           ... идет переброска в режиме <полуавтомат по положению>\n");
                     if (jkw==0){printf("       ==> (-)\n");perebroscsn(999.0,Lmin0,999.0);}
                     else{       printf("       ==> (+)\n");perebroscsn(999.0,Lmax0,999.0);};
                     RESCSN();
                     printf(" OK! ====> Выполнена установка осей в начальное положение\n");
                     printf("           # Lmin0=%+08.4f [угл.град]\n",cd[1]);
                     printf(" ========================================================================\n");
                     printf(" Внимание! Далее технологическая задержка %3.1f [сек]\n",tz5);
                     printf("           Ждите...\n");
                     my_delay(tz5);
                  // printf("Далее нажмите <Enter> =>");
                  // gets(sss);
                     printf(" ========================================================================\n");
                     printf(" Внимание! Переход к управлению в режиме <полуавтомат по скорости>\n");
                     if (jkw==0){printf("       ==> (-V)\n");skorcsn(999.0,-Vtek,999.0);}
                     else{       printf("       ==> (+V)\n");skorcsn(999.0, Vtek,999.0);};
                     printf("           Ждите...\n");
                     jz=0; s1=cd[1]; ds=999.0;
                     while(ds>EpsUg){
                     // printf("           # jz=%d; Lz=%+08.4f [угл.град]\n",jz,cd[1]);
                     // Генератор задержки
                        my_delay(Dt);
                        ds=fabs(s1-cd[1]);
                        s1=cd[1];
                        jz=jz+1;
                     };//while
                     skorcsn(0.0, 0.0, 0.0);
                  // Остановка оси ОПУ
                     printf(" Внимание! КЭП(L)=<Stop>\n");
                     printf(" Внимание! Далее технологическая задержка %3.1f [сек]\n",tz2);
                     printf("           Ждите...\n");
                     my_delay(tz2);
                     printf(" OK! ====> КЭП(A)=<Stop>\n");

                     if (jkw==0){printf(" OK! ====> Выполнен захват ВО оси L (-) 2-го уровня\n");
                                 mDelta[1][0]=cd[1];}
                     else       {printf(" OK! ====> Выполнен захват ВО оси L (+) 2-го уровня\n");
                                 mDelta[1][1]=cd[1];};
                                 printf("           # Lout=%+08.4f [угл.град]\n",cd[1]);
                     printf(" ========================================================================\n");
                     if (jkw==1){
                        printf(" Внимание! Установка оси L в положение технологического <0>\n");
                        printf("           ... ждите\n");
                        printf("           ... идет переброска в режиме <полуавтомат по положению>\n");
                        perebroscsn(999.0,90.0,999.0);
                        RESCSN();
                        printf(" OK! ====> Выполнена установка оси L в положение 90.0 [угл.град]\n");
                        printf(" Внимание! Далее технологическая задержка %3.1f [сек]\n",tz5);
                        printf("           Ждите...\n");
                        my_delay(tz5);
                        printf(" ========================================================================\n");
                     };//jkw==1
                     break;
// case
                 case 2:
                     printf(" Внимание! Выбрана орбитальная ось (ось R)\n");
                     if (jkw==0) printf("           Выбран  левый (-) ВО 2-го уровня\n");
                     else        printf("           Выбран правый (+) ВО 2-го уровня\n");
                     printf("           ... ждите\n");
                     printf("           ... идет переброска в режиме <полуавтомат по положению>\n");
                     if (jkw==0){printf("       ==> (-)\n");perebroscsn(999.0,999.0,Rmin0);}
                     else{       printf("       ==> (+)\n");perebroscsn(999.0,999.0,Rmax0);};
                     RESCSN();
                     printf(" OK! ====> Выполнена установка осей в начальное положение\n");
                     printf("           # Rmin0=%+08.4f [угл.град]\n",cd[2]);
                     printf(" ========================================================================\n");
                     printf(" Внимание! Далее технологическая задержка %3.1f [сек]\n",tz5);
                     printf("           Ждите...\n");
                     my_delay(tz5);
                  // printf("Далее нажмите <Enter> =>");
                  // gets(sss);
                     printf(" ========================================================================\n");
                     printf(" Внимание! Переход к управлению в режиме <полуавтомат по скорости>\n");
                     if (jkw==0){printf("       ==> (-V)\n");skorcsn(999.0,999.0,-Vtek);}
                     else{       printf("       ==> (+V)\n");skorcsn(999.0,999.0, Vtek);};
                     printf("           Ждите...\n");
                     jz=0; s1=cd[2]; ds=999.0;
                     while(ds>EpsUg){
                     // printf("           # jz=%d; ds=%+08.4f Rz=%+08.4f [угл.град]\n",jz,ds,cd[2]);
                     // Генератор задержки
                        my_delay(Dt);
                        ds=fabs(s1-cd[2]);
                        s1=cd[2];
                        jz=jz+1;
                     };//while
                     skorcsn(0.0, 0.0, 0.0);
                  // Остановка оси ОПУ
                     printf(" Внимание! КЭП(L)=<Stop>\n");
                     printf("           Далее технологическая задержка %3.1f [сек]\n",tz2);
                     printf("           Ждите...\n");
                     my_delay(tz2);
                     printf(" OK! ====> КЭП(A)=<Stop>\n");

                     if (jkw==0){printf(" OK! ====> Выполнен захват ВО оси R (-) 2-го уровня\n");
                                 mDelta[2][0]=cd[2];}
                     else       {printf(" OK! ====> Выполнен захват ВО оси R (+) 2-го уровня\n");
                                 mDelta[2][1]=cd[2];};
                                 printf("           # Rout=%+08.4f [угл.град]\n",cd[2]);

                     printf(" ========================================================================\n");
                     if (jkw==1){
                        printf(" Внимание! Установка оси R в положение технологического <0>\n");
                        printf("           ... ждите\n");
                        printf("           ... идет переброска в режиме <полуавтомат по положению>\n");
                        perebroscsn(999.0,999.0,90.0);
                        RESCSN();
                        printf(" OK! ====> Выполнена установка оси R в положение 90.0 [угл.град]\n");
                        printf(" Внимание! Далее технологическая задержка %3.1f [сек]\n",tz5);
                        printf("           Ждите...\n");
                        my_delay(tz5);
                        printf(" ========================================================================\n");
                     };//jkw==1
                     break;
             };//switch
          // printf("Далее нажмите <Enter> =>");
          // gets(sss);
          };//jkw - Цикл по ВО 2-го уровня
       };//jos - Цикл по осям ОПУ

       printf(" ========================================================================\n");
       printf(" Внимание! Отработан режим диагностики по всем осям ОПУ\n");
       printf(" ========================================================================\n");
       printf(" # Ось A : min=%+011.6f; max=%+011.6f; delta=%+011.6f; [град]\n",mDelta[0][0],mDelta[0][1], fabs(mDelta[0][1]-mDelta[0][0]));
       printf(" # Ось L : min=%+011.6f; max=%+011.6f; delta=%+011.6f; [град]\n",mDelta[1][0],mDelta[1][1], fabs(mDelta[1][1]-mDelta[1][0]));
       printf(" # Ось R : min=%+011.6f; max=%+011.6f; delta=%+011.6f; [град]\n",mDelta[2][0],mDelta[2][1], fabs(mDelta[2][1]-mDelta[2][0]));
       printf(" ========================================================================\n");
       dec_gms(mDelta[0][0],&ugi,&umi,&usi);
       printf(" # Ось A : min=%+03d.%02d.%02d; ",ugi,umi,usi);
       dec_gms(mDelta[0][1],&ugi,&umi,&usi);
       printf("max=%03d.%02d.%02d; ", ugi,umi,usi);
       dec_gms(fabs(mDelta[0][1]-mDelta[0][0]),&ugi,&umi,&usi);
       printf("delta=%03d.%02d.%02d; [град.мин.сек]\n", ugi,umi,usi);
    // ------------------------------------------------------------------------
       dec_gms(mDelta[1][0],&ugi,&umi,&usi);
       printf(" # Ось L : min=%+03d.%02d.%02d; ",ugi,umi,usi);
       dec_gms(mDelta[1][1],&ugi,&umi,&usi);
       printf("max=%03d.%02d.%02d; ", ugi,umi,usi);
       dec_gms(fabs(mDelta[1][1]-mDelta[1][0]),&ugi,&umi,&usi);
       printf("delta=%03d.%02d.%02d; [град.мин.сек]\n", ugi,umi,usi);
    // ------------------------------------------------------------------------
       dec_gms(mDelta[2][0],&ugi,&umi,&usi);
       printf(" # Ось R : min=%+03d.%02d.%02d; ",ugi,umi,usi);
       dec_gms(mDelta[2][1],&ugi,&umi,&usi);
       printf("max=%03d.%02d.%02d; ", ugi,umi,usi);
       dec_gms(fabs(mDelta[2][1]-mDelta[2][0]),&ugi,&umi,&usi);
       printf("delta=%03d.%02d.%02d; [град.мин.сек]\n", ugi,umi,usi);
    // ------------------------------------------------------------------------
       printf(" ========================================================================\n");
       printf(" Запись (перезапись) в файл БД: <y,Y>-да; <Enter>-нет;\n");
       printf(" =>");
       gets(sss);
       printf(" ========================================================================\n");
    // Запись данных в файл БД
       if ((sss[0]=='y')||(sss[0]=='Y')){
//        FILE *f_Data;
//        f_Data=fopen("tmpdan/modkw60.txt","w");
          FILE *f_Data;
          switch (nST_OES){
             case 561:
                 f_Data=fopen("tmpdan/modkw561.txt","w");
                 break;
             case 562:
                 f_Data=fopen("tmpdan/modkw562.txt","w");
                 break;
                          // --------------------------------
             case 571:
                 f_Data=fopen("tmpdan/modkw571.txt","w");
                 break;
             case 572:
                 f_Data=fopen("tmpdan/modkw572.txt","w");
                 break;
                          // --------------------------------
             case 581:
                 f_Data=fopen("tmpdan/modkw581.txt","w");
                 break;
             case 582:
                 f_Data=fopen("tmpdan/modkw582.txt","w");
                 break;
                          // --------------------------------
             case 591:
                 f_Data=fopen("tmpdan/modkw591.txt","w");
                 break;
             case 592:
                 f_Data=fopen("tmpdan/modkw592.txt","w");
                 break;
                          // --------------------------------
             case 601:
                 f_Data=fopen("tmpdan/modkw601.txt","w");
                 break;
             case 602:
                 f_Data=fopen("tmpdan/modkw602.txt","w");
                 break;
                          // --------------------------------
          };//switch

       // Цикл по осям ОПУ
          for(jos=0; jos<3; jos++){
          // -------------------------------------
             fprintf(f_Data,"%+011.6f",mDelta[jos][0]);
             fprintf(f_Data,"%c",' ');
          // -------------------------------------
             fprintf(f_Data,"%+011.6f",mDelta[jos][1]);
             fprintf(f_Data,"%c",' ');
          // -------------------------------------
             fprintf(f_Data,"%+011.6f",fabs(mDelta[jos][1]-mDelta[jos][0]));
             fprintf(f_Data,"%c",'\n');
          };//jos
          fclose(f_Data);
          printf(" OK! ====> Выполнена запись в файл БД с наименованием <tmpdan/modkwXX.txt>\n");
       }else{
          printf(" Внимание! Запись данных в файл БД не выполнялась\n");
       };//if
       printf(" ========================================================================\n");
//
//       printf(" Внимание! Установка осей в положение технологического <0>\n");
    // my_delay(1.0);
//       printf("           ... ждите\n");
//       printf("           ... идет переброска в режиме <полуавтомат по положению>\n");
//       perebroscsn(0.0,90.0,90.0);
//       RESCSN();
//       printf(" OK! ====> Выполнена установка осей в исходное положение\n");
//       printf(" ========================================================================\n");
//
   }//void modkw() - Исследование характеристик ВО
// -----------------------------------------------------------------------

// Исследование характеристик CD
   void modcd3(){
    // =======================================================================
    // Начало описания дополнительных переменных
    // =======================================================================
       char sss[256];
    // Коэффициенты пересчета
       double Pi,Pi2,gr,mr,sr;
       Pi =3.1415926;
       Pi2=2.0*Pi;
       gr =Pi/180.0;
       mr =gr/60.0;
       sr =mr/60.0;
    // Системные переменные
       int nTK_OES=1; // номер камеры
       int nST_OES=591;// номер ОЭС

    // Переменные выбора режима интерфейса (вывод данных на экран)
       int  nScr=-1;
       char sScr[256];

    // Переменные выбора режима фильтрации
       int  nReg=-1;
       char sReg[256];

    // Признак первого прохода
       bool prCP =false;
    // Переменные цикла
       int iz,jz,kz,Nz,js;
    // Темп
       double Dt=1.0; // сек.
    // Скорость
       double Vtek= 30.0*mr/gr;
    // Начальная фаза
       double UgA0;
       double UgL0;
       double UgR0;
    // Порог срабатывния
       double UgEnd=145.0;

    // Начальная установка осей
       UgA0=-55.0;
       UgL0= 35.0;
       UgR0= 35.0;

       printf(" Внимание! Запущен модуль формирования характеристик CD\n");
       printf("           -------------------------------------------------------\n");
       printf("           # режим - <полуавтомат по скорости>\n",Vtek);
       printf("           # Vtek=%+08.4f [угл.мин/сек]; Dt=%f [сек]\n",Vtek*gr/mr,Dt);
       printf("           -------------------------------------------------------\n");
       printf(" Внимание! Установка осей ОПУ в начальное положение\n");
       printf("           Ждите... идет переброска в режиме <полуавтомат по положению>\n");
       perebroscsn(UgA0,UgL0,UgR0);
       RESCSN();
       printf("           -------------------------------------------------------\n");
       printf(" OK! ====> Выполнена установка осей в начальное положение\n");
       printf("           # UgA0=%+08.4f [угл.град] - начальная фаза по оси <A>\n",cd[0]);
       printf("           # UgL0=%+08.4f [угл.град] - начальная фаза по оси <L>\n",cd[1]);
       printf("           # UgR0=%+08.4f [угл.град] - начальная фаза по оси <R>\n",cd[2]);
    // Начальная установка осей
       UgA0=cd[0];
       UgL0=cd[1];
       UgR0=cd[2];
       printf(" ========================================================================\n");
       printf(" Внимание! Далее технологическая задержка 5.0 сек.\n");
       printf("           Ждите...\n");
       my_delay(5.0);
       printf("Далее нажмите <Enter> =>");
       gets(sss);
       printf(" ========================================================================\n");
       printf(" Внимание! Идет формирования характеристик CD\n");
       printf("           Ждите...\n");

//     goto mmm;
//     FILE *f_Data;
//     f_Data=fopen("tmpdan/modcd60.txt","w");
       FILE *f_Data;
       switch (nST_OES){
             case 561:
                 f_Data=fopen("tmpdan/modcd561.txt","w");
                 break;
             case 562:
                 f_Data=fopen("tmpdan/modcd562.txt","w");
                 break;
              // --------------------------------
             case 571:
                 f_Data=fopen("tmpdan/modcd571.txt","w");
                 break;
             case 572:
                 f_Data=fopen("tmpdan/modcd572.txt","w");
                 break;
              // --------------------------------
             case 581:
                 f_Data=fopen("tmpdan/modcd581.txt","w");
                 break;
             case 582:
                 f_Data=fopen("tmpdan/modcd582.txt","w");
                 break;
              // --------------------------------
             case 591:
                 f_Data=fopen("tmpdan/modcd591.txt","w");
                 break;
             case 592:
                 f_Data=fopen("tmpdan/modcd592.txt","w");
                 break;
              // --------------------------------
             case 601:
                 f_Data=fopen("tmpdan/modcd601.txt","w");
                 break;
             case 602:
                 f_Data=fopen("tmpdan/modcd602.txt","w");
                 break;
              // --------------------------------
       };//switch
    // Начать движение ОПУ
    // skorcsn(Vtek,999,999);
    // skorcsn(999,Vtek,999);
    // skorcsn(999,999,Vtek);
    // -------------------------
       skorcsn(Vtek,Vtek,Vtek);

       jz=0;
    // Порог по оси <L> !!!.
       while(cd[1]<UgEnd){
       // -------------------------------------
          fprintf(f_Data,"%014.8f",1.0*jz);//*Dt*Vtek);
          fprintf(f_Data,"%c",' ');
       // ===================================
          fprintf(f_Data,"%014.8f",cd[0]);
          fprintf(f_Data,"%c",' ');
       // -----------------------------------

          fprintf(f_Data,"%014.8f",cd[1]);
          fprintf(f_Data,"%c",' ');
       // -------------------------------------
          fprintf(f_Data,"%014.8f",cd[2]);
          fprintf(f_Data,"%c",'\n');

       // -------------------------------------
          printf(" jz=%d; Vtek=%08.4f; cd[0]=%012.6f; cd[1]=%012.6f; cd[2]=%012.6f;\n",jz,Vtek,cd[0],cd[1],cd[2]);
       // -------------------------------------
          jz=jz+1;
       // Генератор задержки
          my_delay(1.0);
       // skorcsn(Vtek,Vtek,Vtek);
       // usleep(Dt*1000000);
       };//jz
    // Остановка оси ОПУ
       skorcsn(0.0,0.0,0.0);

    //   skorcsn(0.001,0.001,0.001);
    //   skorcsn(999,999,999);
    //   my_delay(1.0);
    //   perebroscsn(cd[0]+0.1,cd[1]+0.1,cd[2]+0.1);
    //   RESCSN();
       fclose(f_Data);
mmm:;
       printf(" ========================================================================\n");
       printf(" Внимание! Закончил работу модуль формирования характеристик CD\n");
       printf("           -------------------------------------------------------\n");
       printf("           # сформирован файл данных с наименованием <tmpdan/modcdXX.txt>\n",Vtek);
       printf("           # режим - <полуавтомат по скорости>\n",Vtek);
       printf("           # Vtek=%+08.4f [угл.мин/сек]; Dt=%f [сек]\n",Vtek*gr/mr,Dt);
       printf("           -------------------------------------------------------\n");
       printf(" Инфо ===> Положение осей ОПУ на момент начала работы\n");
       printf("           # UgA0=%+08.4f [угл.град] - начальная фаза по оси <A>\n",UgA0);
       printf("           # UgL0=%+08.4f [угл.град] - начальная фаза по оси <L>\n",UgL0);
       printf("           # UgR0=%+08.4f [угл.град] - начальная фаза по оси <R>\n",UgR0);
       printf("           -------------------------------------------------------\n");
       printf(" Инфо ===> Положение осей ОПУ на момент окончания работы\n");
       printf("           # UgA=%+08.4f [угл.град]  - по оси <A>\n",cd[0]);
       printf("           # UgL=%+08.4f [угл.град]  - по оси <L>\n",cd[1]);
       printf("           # UgR=%+08.4f [угл.град]  - по оси <R>\n",cd[2]);
       printf(" ========================================================================\n");
       printf("Далее нажмите <Enter> =>");
       gets(sss);
       printf(" ========================================================================\n");
   }//void modcd3() - Исследование характеристик CD
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Baikov
